{
    "1803.01164": {
        "paper_id": "1803.01164",
        "abs_url": "https://arxiv.org/abs/1803.01164",
        "pdf_url": "https://arxiv.org/pdf/1803.01164.pdf",
        "supp_url": null,
        "src_website": "ArXiv",
        "download_name": "1803.01164_The_History_Began_from_AlexNet_A_Comprehensive_Survey_on_Deep_Learning_Approaches.pdf",
        "title": "The History Began from AlexNet: A Comprehensive Survey on Deep Learning Approaches",
        "year": null,
        "paper_venue": null,
        "authors": [
            "Md Zahangir Alom",
            "Tarek M. Taha",
            "Christopher Yakopcic",
            "Stefan Westberg",
            "Paheding Sidike",
            "Mst Shamima Nasrin",
            "Brian C Van Esesn",
            "Abdul A S. Awwal",
            "Vijayan K. Asari"
        ],
        "abstract": "Deep learning has demonstrated tremendous success in variety of application domains in the past few years. This new field of machine learning has been growing rapidly and applied in most of the application domains with some new modalities of applications, which helps to open new opportunity. There are different methods have been proposed on different category of learning approaches, which includes supervised, semi-supervised and un-supervised learning. The experimental results show state-of-the-art performance of deep learning over traditional machine learning approaches in the field of Image Processing, Computer Vision, Speech Recognition, Machine Translation, Art, Medical imaging, Medical information processing, Robotics and control, Bio-informatics, Natural Language Processing (NLP), Cyber security, and many more. This report presents a brief survey on development of DL approaches, including Deep Neural Network (DNN), Convolutional Neural Network (CNN), Recurrent Neural Network (RNN) including Long Short Term Memory (LSTM) and Gated Recurrent Units (GRU), Auto-Encoder (AE), Deep Belief Network (DBN), Generative Adversarial Network (GAN), and Deep Reinforcement Learning (DRL). In addition, we have included recent development of proposed advanced variant DL techniques based on the mentioned DL approaches. Furthermore, DL approaches have explored and evaluated in different application domains are also included in this survey. We have also comprised recently developed frameworks, SDKs, and benchmark datasets that are used for implementing and evaluating deep learning approaches. There are some surveys have published on Deep Learning in Neural Networks [1, 38] and a survey on RL [234]. However, those papers have not discussed the individual advanced techniques for training large scale deep learning models and the recently developed method of generative models [1].",
        "comments": "39 pages, 46 figures, 3 tables. arXiv admin note: text overlap with arXiv:1408.3264 , arXiv:1411.4046",
        "official_code_urls": [],
        "pwc_page_url": "https://paperswithcode.com/paper/the-history-began-from-alexnet-a",
        "bibtex": "@misc{alom2018history,\n      title={The History Began from AlexNet: A Comprehensive Survey on Deep Learning Approaches}, \n      author={Md Zahangir Alom and Tarek M. Taha and Christopher Yakopcic and Stefan Westberg and Paheding Sidike and Mst Shamima Nasrin and Brian C Van Esesn and Abdul A S. Awwal and Vijayan K. Asari},\n      year={2018},\n      eprint={1803.01164},\n      archivePrefix={arXiv},\n      primaryClass={cs.CV}\n}"
    }
}